
Процедура ОбработатьСообщение(КомпонентаСервер, Сообщение, ПараметрыРаботыСервера) Экспорт 
	
	ОбработкаСообщения_ОТЛАДКА_ЭХО(КомпонентаСервер, Сообщение);
	//бит_РаботаСАнализаторамиСервер.ОбработатьСообщение_TCP(КомпонентаСервер, Сообщение, ПараметрыРаботыСервера);
	
КонецПроцедуры

Процедура ОбработкаСообщения_ОТЛАДКА_ЭХО(КомпонентаСервер, Сообщение)
	
	СообщениеСтруктура = бит_КомпонентаSynchClientServerКлиентСервер.ПолучитьСтруктуруДанныхСообщения(Сообщение);
	
	ВходящееСообщениеСодержание = СообщениеСтруктура.Содержание;
	
	Ответ = ВходящееСообщениеСодержание + " <response>";	
	СообщениеОтветJson = бит_КомпонентаSynchClientServerКлиентСервер.СформироватьНовоеСообщениеJson(
		СообщениеСтруктура.IDСокета, 
		СообщениеСтруктура.НомерПорта, 
		Ответ
	);																	  
	бит_КомпонентаSynchClientServerКлиентСервер.ОтправитьСообщение(КомпонентаСервер, СообщениеОтветJson);
			
КонецПроцедуры

